eamodio.gitlens
esbenp.prettier-vscode
github.copilot
github.copilot-chat
james-yu.latex-workshop
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.remote-explorer
streetsidesoftware.code-spell-checker
vscodevim.vim
